import { cn } from "@/lib/utils";

const OSLogo = () => {
  return (
    <div className="flex flex-col items-center justify-center animate-in fade-in duration-500">
      <pre
        className={cn(
            "font-headline text-2xl md:text-4xl text-center leading-none text-primary",
            "drop-shadow-[0_0_8px_hsl(var(--primary))] animate-pulse"
        )}
      >
        {`
 ██████╗██╗  ██╗██╗██████╗ ██╗   ██╗
██╔════╝██║  ██║██║██╔══██╗██║   ██║
██║     ███████║██║██████╔╝██║   ██║
██║     ██╔══██║██║██╔══██╗╚██╗ ██╔╝
╚██████╗██║  ██║██║██║  ██║ ╚████╔╝ 
 ╚═════╝╚═╝  ╚═╝╚═╝╚═╝  ╚═╝  ╚═══╝  
        `}
      </pre>
      <p className="text-lg">v1.0</p>
    </div>
  );
};

export default OSLogo;
